Repository: Muesli84/FinanceManager
Catalog: FinanceManager.Web/Resources/Components/Pages/Legal.*.resx
Languages: de

# Title
source: Legal
de: Rechtliches

# Intro
source: This page provides information about the source code, third-party components and privacy aspects of this application.
de: Diese Seite informiert über Quellcode, verwendete Komponenten sowie Datenschutz-Aspekte dieser Anwendung.

# Section_Usage
source: Usage
de: Nutzung

# Usage_Private
source: The application is intended for private use. A technically skilled private user can install and run it as a server application on a home computer.
de: Die Anwendung ist für die private Nutzung gedacht. Ein technisch versierter Privatanwender kann die Anwendung auf einem Heimrechner als Serveranwendung installieren und verwenden.

# Usage_LocalStorage
source: Application data is stored locally on the user's machine in a SQLite database, unless configured otherwise.
de: Die Anwendungsdaten werden lokal auf dem eigenen Gerät in einer SQLite-Datenbank gespeichert, sofern keine andere Datenbank konfiguriert wurde.

# Usage_OperatorDisclosure
source: If the application is made available to other persons (e.g., in a home network or beyond), the operator must provide information about the processing of personal data (purposes, retention, recipients) and about any third-party services used.
de: Sofern die Anwendung anderen Personen bereitgestellt wird (z. B. im Heimnetz oder darüber hinaus), muss der Betreiber über die Verarbeitung personenbezogener Daten informieren (Zwecke, Speicherdauer, Empfänger) und auf etwaige Drittanbieter hinweisen.

# Section_Source
source: Source / Repository
de: Quellcode / Repository

# Section_ThirdParty
source: Third-party components
de: Drittanbieter-Komponenten

# ThirdParty_Intro
source: This application uses open-source libraries (NuGet) and optional third-party web APIs.
de: Diese Anwendung verwendet Open-Source-Bibliotheken (NuGet) sowie optionale Web-APIs von Drittanbietern.

# ThirdParty_NuGet
source: NuGet packages (excerpt): Microsoft.EntityFrameworkCore.*, Microsoft.Data.Sqlite, Nager.Date (holidays), System.Text.Json, etc.
de: NuGet-Pakete (Auszug): Microsoft.EntityFrameworkCore.*, Microsoft.Data.Sqlite, Nager.Date (Feiertage), System.Text.Json, u.a.

# ThirdParty_Apis
source: Optional web APIs: AlphaVantage (price data) - only when an API key is configured and explicitly used; requests include IP/client data per their policies.
de: Optionale Web-APIs: AlphaVantage (Kursdaten) - nur bei hinterlegtem API-Schlüssel und expliziter Nutzung; Anfragen enthalten IP-/Client-Daten gemäß deren Richtlinien.

# ThirdParty_NuGetPackages
source: NuGet packages
de: NuGet-Pakete

# ThirdParty_TestPackages
source: Test packages
de: Test-Pakete

# Label_TestsOnly
source: tests only
de: nur in Tests

# Section_Privacy
source: Privacy
de: Datenschutz

# Privacy_SessionCookie
source: This application uses a session/auth cookie (FinanceManager.Auth) to manage signed-in sessions. The cookie contains a JWT token used solely for authentication.
de: Diese Anwendung verwendet ein Session-/Auth-Cookie (fm_auth), um angemeldete Sitzungen zu verwalten. Das Cookie enthält ein JWT-Token, das ausschließlich zur Authentifizierung genutzt wird.

# Privacy_ThirdParty
source: When using external services (e.g., price lookups), data (IP address, request timestamp) may be transmitted to those providers. Please refer to their privacy policies.
de: Bei Nutzung externer Dienste (z. B. Kursabrufe) können Daten (IP-Adresse, Anfragezeitpunkt) an Anbieter übertragen werden. Bitte prüfen Sie die Datenschutzhinweise der jeweiligen Dienste.

# Section_Other
source: Other information
de: Weitere Hinweise

# Other_Disclaimer
source: No guarantee for correctness. Use at your own risk. No financial or investment advice.
de: Alle Angaben ohne Gewähr. Nutzung auf eigenes Risiko. Es werden keine Finanz- oder Anlageberatungen erbracht.

# Other_Contact
source: Contact/Feedback: Issues and discussions welcome in the GitHub repository.
de: Kontakt/Feedback: Issues und Diskussionen im GitHub-Repository willkommen.
