Repository: Muesli84/FinanceManager
Catalog: FinanceManager.Web/Resources/Components/Pages/SetupNotificationsTab.*.resx
Languages: de

# Notifications_TabTitle
source: Notifications
de: Benachrichtigungen

# Notifications_MonthlyReminder
source: Enable month-end reminder
de: Monatsabschluss-Hinweis aktivieren

# Notifications_MonthlyReminder_Help
source: Show a reminder on the last business day of the month on the home page.
de: Am letzten Werktag des Monats eine Erinnerung auf der Startseite anzeigen.

# Notifications_MonthlyReminder_Time
source: Time (local)
de: Uhrzeit (lokal)

# Notifications_MonthlyReminder_Time_Help
source: Preferred time to receive the reminder (HH:mm). Default 09:00.
de: Bevorzugte Uhrzeit fuer die Erinnerung (HH:mm). Standard 09:00.

# Notifications_Holidays_Provider
source: Holiday source
de: Feiertags-Quelle

# Notifications_Holidays_Provider_Help
source: Source for public holidays: Memory (simple, country only) or Nager.Date (country + region/counties).
de: Quelle fuer den Feiertagskalender: Memory (einfach, nur Land) oder Nager.Date (Land + Region/Counties).

# Notifications_Holidays_Region
source: Holiday region
de: Feiertags-Region

# Notifications_Holidays_Region_Help
source: Country (e.g., DE) and optional subdivision (e.g., DE-BY) to consider public holidays.
de: Land (z.B. DE) und optional Bundesland/Region (z.B. DE-BY) zur Beruecksichtigung gesetzlicher Feiertage.

# Notifications_SaveSuccess
source: Settings saved.
de: Einstellungen gespeichert.

# Msg_Loading
source: Loading ...
de: Lade ...

# Btn_Retry
source: Retry
de: Erneut versuchen

# Btn_Save
source: Save
de: Speichern

# Btn_Reset
source: Reset
de: Zuruecksetzen
